Cinema/Documents/ПродажаБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПродажаБилетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доход</xr:Item>
				<xr:Item>AccumulationRegister.Билетики</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фильмы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фильмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщийДоход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Cinema/AccumulationRegisters/Билетики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>Билетики</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фильмы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Cinema/Documents/ПродажаБилетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧасть1ЦенаПриИзменении(Элемент)
	Элементы.ТабличнаяЧасть1.ТекущиеДанные.ОбщийДоход=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Количество*Элементы.ТабличнаяЧасть1.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Количество ;
	b=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Фильмы ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	БилетикиОстатки.Фильмы КАК Фильмы,
	              |	БилетикиОстатки.КоличествоОстаток КАК КоличествоОстаток,
	              |	БилетикиОстатки.ЦенаОстаток КАК ЦенаОстаток
	              |ИЗ
	              |	РегистрНакопления.Билетики.Остатки КАК БилетикиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Фильмы",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b,"Фильмы") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
		
	конецесли;
КонецПроцедуры
